Repository: xcv58/MacTools
Catalog: Plugins/AIAssistant/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt, ru, tr, zh_hant

# panel.subtitle.clipboardReady
source: 按下模板快捷键处理剪贴板文本
ar: اضغط على اختصار أحد التوجيهات لمعالجة نص الحافظة
de: Tastenkombination für Prompt drücken, um Text aus der Zwischenablage zu verarbeiten
en: Press a prompt shortcut to process clipboard text
es: Pulsa el atajo de teclado de un prompt para procesar el texto del portapapeles
fr: Appuyez sur un raccourci de prompt pour traiter le texte du presse-papiers
ja: プロンプトのショートカットを押してクリップボードのテキストを処理します
ko: 클립보드 텍스트를 처리하려면 프롬프트 단축키를 누르세요.
pt: Pressione um atalho de prompt para processar o texto da área de transferência
ru: Нажмите сочетание клавиш промпта, чтобы обработать текст из буфера обмена
tr: Pano metnini işlemek için bir istem kısayoluna basın
zh_hant: 按下模板快速鍵處理剪貼簿文字

# panel.status.capturing
source: 正在读取选中文本...
ar: قراءة النص المحدد...
de: Ausgewählten Text lesen...
en: Reading selected text...
es: Leyendo el texto seleccionado...
fr: Lecture du texte sélectionné...
ja: 選択したテキストを読み取り中...
ko: 선택한 텍스트를 읽는 중...
pt: Lendo texto selecionado...
ru: Чтение выделенного текста...
tr: Seçili metin okunuyor...
zh_hant: 正在讀取選取的文字...

# panel.status.processing
source: 正在处理...
ar: جارٍ المعالجة...
de: Wird verarbeitet...
en: Processing...
es: Procesando...
fr: Traitement...
ja: 処理中...
ko: 처리 중...
pt: Processando...
ru: Обработка...
tr: İşleniyor...
zh_hant: 正在處理...

# panel.status.reprocessing
source: 正在重新处理，先前的结果暂时保留...
ar: جارٍ إعادة المعالجة؛ تُحفظ النتيجة السابقة مؤقتًا...
de: Erneuter Durchlauf; das vorherige Ergebnis bleibt vorerst erhalten...
en: Rerunning; the previous result is kept for now...
es: Procesando de nuevo; el resultado anterior se conserva por ahora...
fr: Réexécution ; le résultat précédent est conservé pour l'instant...
ja: 再処理中です。前回の結果は一時的に保持されています...
ko: 다시 처리하는 중이며, 이전 결과는 일단 유지됩니다...
pt: Processando novamente; o resultado anterior é mantido por enquanto...
ru: Повторный запуск; предыдущий результат пока сохраняется...
tr: Yeniden çalıştırılıyor; önceki sonuç şimdilik korunuyor...
zh_hant: 正在重新處理，先前的結果暫時保留...

# panel.action.stop
source: 停止当前处理
ar: إيقاف المعالجة الحالية
de: Aktuellen Vorgang stoppen
en: Stop Current Run
es: Detener ejecución actual
fr: Arrêter l'exécution en cours
ja: 現在の実行を停止
ko: 현재 실행 중지
pt: Parar execução atual
ru: Остановить текущий запуск
tr: Geçerli Çalışmayı Durdur
zh_hant: 停止目前處理

# panel.action.discard
source: 丢弃会话并关闭
ar: تجاهل وإغلاق
de: Verwerfen und schließen
en: Discard and Close
es: Descartar y cerrar
fr: Abandonner la session et fermer
ja: 破棄して閉じる
ko: 폐기 및 닫기
pt: Descartar e fechar
ru: Отбросить и закрыть
tr: At ve Kapat
zh_hant: 丟棄對話並關閉

# panel.action.hide
source: 隐藏 (Esc)
ar: إخفاء
de: Ausblenden
en: Hide
es: Ocultar
fr: Masquer
ja: 隠す
ko: 숨기기
pt: Ocultar
ru: Скрыть
tr: Gizle
zh_hant: 隱藏 (Esc)

# panel.confirm.title
source: 疑似剪贴板内容
ar: محتوى الحافظة المحتمل
de: Möglicher Inhalt der Zwischenablage
en: Possible Clipboard Content
es: Posible contenido del portapapeles
fr: Contenu provenant peut-être du presse-papiers
ja: クリップボードから取得した可能性のある内容
ko: 클립보드에서 가져온 것으로 추정되는 내용
pt: Possível conteúdo da área de transferência
ru: Возможное содержимое буфера обмена
tr: Olası Pano İçeriği
zh_hant: 疑似剪貼簿內容

# panel.confirm.description
source: 未能直接读取选中文本，以上内容来自剪贴板。请确认是否将其发送给 AI 处理。
ar: تعذرت قراءة النص المحدد مباشرة؛ المحتوى أعلاه مأخوذ من الحافظة. أكّد قبل إرساله إلى الذكاء الاصطناعي.
de: Der ausgewählte Text konnte nicht direkt gelesen werden; der obige Inhalt stammt aus der Zwischenablage. Bitte bestätigen, bevor er an die KI gesendet wird.
en: The selected text could not be read directly; the content above comes from the clipboard. Confirm before sending it to AI.
es: No se pudo leer directamente el texto seleccionado; el contenido de arriba proviene del portapapeles. Confirma antes de enviarlo a la IA.
fr: Le texte sélectionné n’a pas pu être lu directement ; le contenu ci-dessus provient du presse-papiers. Confirmez avant de l’envoyer à l’IA.
ja: 選択したテキストを直接読み取ることができませんでした。上のコンテンツはクリップボードから取得したものです。 AIに送信する前に確認してください。
ko: 선택한 텍스트를 직접 읽을 수 없습니다. 위의 내용은 클립보드에서 가져온 것입니다. AI로 보내기 전에 확인하세요.
pt: O texto selecionado não pôde ser lido diretamente; o conteúdo acima vem da área de transferência. Confirme antes de enviá-lo à IA.
ru: Не удалось прочитать выделенный текст напрямую; выше показано содержимое буфера обмена. Подтвердите его перед отправкой ИИ.
tr: Seçili metin doğrudan okunamadı; yukarıdaki içerik panodan geliyor. Yapay zekâya göndermeden önce onaylayın.
zh_hant: 無法直接讀取選取的文字，以上內容來自剪貼簿。請確認是否將其傳送給 AI 處理。

# panel.confirm.useText
source: 使用此文本
ar: استخدم هذا النص
de: Diesen Text verwenden
en: Use This Text
es: Usar este texto
fr: Utiliser ce texte
ja: このテキストを使用
ko: 이 텍스트 사용
pt: Usar este texto
ru: Использовать этот текст
tr: Bu Metni Kullan
zh_hant: 使用此文字

# panel.confirm.discard
source: 放弃
ar: تجاهل
de: Verwerfen
en: Discard
es: Descartar
fr: Abandonner
ja: 破棄
ko: 폐기
pt: Descartar
ru: Отбросить
tr: At
zh_hant: 放棄

# panel.source.title
source: 原始文本
ar: النص المصدر
de: Quelltext
en: Source Text
es: Texto fuente
fr: Texte source
ja: 元のテキスト
ko: 소스 텍스트
pt: Texto original
ru: Исходный текст
tr: Kaynak Metin
zh_hant: 原始文字

# panel.source.empty
source: 未检测到选中文本
ar: لم يتم اكتشاف نص محدد
de: Kein markierter Text erkannt
en: No selected text detected
es: No se detectó ningún texto seleccionado
fr: Aucun texte sélectionné détecté
ja: 選択されたテキストが検出されませんでした
ko: 선택한 텍스트가 감지되지 않습니다.
pt: Nenhum texto selecionado detectado
ru: Выделенный текст не обнаружен
tr: Seçili metin algılanmadı
zh_hant: 未偵測到選取的文字

# panel.source.editing
source: （正在编辑）
ar: (قيد التحرير)
de: (Bearbeitung)
en: (Editing)
es: (Edición)
fr: (Édition)
ja: (編集中)
ko: (편집)
pt: (Editando)
ru: (Редактирование)
tr: (Düzenleniyor)
zh_hant: （正在編輯）

# panel.source.hint
source: （双击文本或点按“编辑”）
ar: (انقر على النص نقرًا مزدوجًا أو انقر على «تحرير»)
de: (Auf den Text doppelklicken oder auf „Bearbeiten“ klicken)
en: (Double-click the text or click Edit)
es: (Haz doble clic en el texto o haz clic en «Editar»)
fr: (Double-cliquez sur le texte ou cliquez sur « Modifier »)
ja: （テキストをダブルクリックするか、「編集」をクリック）
ko: (텍스트를 이중 클릭하거나 ‘편집’을 클릭하세요)
pt: (Clique duas vezes no texto ou clique em Editar)
ru: (Дважды щёлкните по тексту или нажмите «Изменить»)
tr: (Düzenlemek için çift tıklayın veya tıklayın)
zh_hant: （按兩下文字或按一下「編輯」）

# panel.source.editButton
source: 编辑
ar: تحرير
de: Bearbeiten
en: Edit
es: Editar
fr: Modifier
ja: 編集
ko: 편집
pt: Editar
ru: Изменить
tr: Düzenle
zh_hant: 編輯

# panel.source.applyAndRerun
source: 应用并重新处理
ar: تطبيق وإعادة المعالجة
de: Anwenden und erneut ausführen
en: Apply and Rerun
es: Aplicar y volver a ejecutar
fr: Appliquer et réexécuter
ja: 適用して再実行
ko: 적용 및 재실행
pt: Aplicar e executar novamente
ru: Применить и повторить запуск
tr: Uygula ve Yeniden Çalıştır
zh_hant: 套用並重跑

# panel.result.copy
source: 复制
ar: نسخ
de: Kopieren
en: Copy
es: Copiar
fr: Copier
ja: コピー
ko: 복사
pt: Copiar
ru: Копировать
tr: Kopyala
zh_hant: 複製

# panel.result.copied
source: 已复制
ar: تم النسخ
de: Kopiert
en: Copied
es: Copiado
fr: Copié
ja: コピー済み
ko: 복사됨
pt: Copiado
ru: Скопировано
tr: Kopyalandı
zh_hant: 已複製

# panel.reasoning.title
source: 思考过程
ar: الاستدلال
de: Denkprozess
en: Reasoning
es: Razonamiento
fr: Raisonnement
ja: 推論
ko: 추론
pt: Raciocínio
ru: Рассуждение
tr: Akıl Yürütme
zh_hant: 思考過程

# panel.tip.title
source: 提示
ar: نصيحة
de: Tipp
en: Tip
es: Consejo
fr: Conseil
ja: ヒント
ko: 팁
pt: Dica
ru: Совет
tr: İpucu

# panel.tip.actionTitle
source: 如何解决
ar: كيفية الإصلاح
de: Lösungsweg
en: How to fix
es: Cómo solucionarlo
fr: Comment réparer
ja: 修正方法
ko: 해결 방법
pt: Como corrigir
ru: Как исправить
tr: Nasıl düzeltilir
zh_hant: 如何解決

# panel.tip.enterTextManually
source: 手动输入文本
ar: اكتب نصًا بدلاً من ذلك
de: Stattdessen Text eingeben
en: Type Text Instead
es: Introducir texto manualmente
fr: Tapez du texte à la place
ja: テキストを手動入力
ko: 직접 텍스트 입력
pt: Digitar texto manualmente
ru: Ввести текст вручную
tr: Metni Elle Girin
zh_hant: 手動輸入文字

# panel.retryHelp
source: 重试
ar: إعادة المحاولة
de: Wiederholen
en: Retry
es: Reintentar
fr: Réessayer
ja: 再試行
ko: 재시도
pt: Tentar novamente
ru: Повторить
tr: Yeniden dene
zh_hant: 重試

# panelError.missingSelection
source: 未找到选中文本
ar: لم يتم العثور على نص محدد.
de: Kein markierter Text gefunden.
en: No selected text found.
es: No se encontró ningún texto seleccionado.
fr: Aucun texte sélectionné trouvé.
ja: 選択されたテキストが見つかりません。
ko: 선택한 텍스트가 없습니다.
pt: Nenhum texto selecionado encontrado.
ru: Выделенный текст не найден.
tr: Seçili metin bulunamadı.
zh_hant: 未找到選取的文字

# panelError.missingClipboardText
source: 剪贴板没有文本
ar: لا تحتوي الحافظة على نص.
de: Die Zwischenablage enthält keinen Text.
en: The clipboard has no text.
es: El portapapeles no tiene texto.
fr: Le presse-papiers ne contient aucun texte.
ja: クリップボードにテキストがありません。
ko: 클립보드에 텍스트가 없습니다.
pt: A área de transferência não possui texto.
ru: В буфере обмена нет текста.
tr: Pano metin içermiyor.
zh_hant: 剪貼簿沒有文字

# panelError.missingConfiguration
source: 请先配置 AI 服务
ar: قم بتكوين خدمة الذكاء الاصطناعي أولاً.
de: Konfigurieren Sie zuerst den KI-Dienst.
en: Configure the AI service first.
es: Primero configure el servicio de IA.
fr: Configurez d’abord le service IA.
ja: 先に AI サービスを設定してください。
ko: 먼저 AI 서비스를 구성하세요.
pt: Configure primeiro o serviço de IA.
ru: Сначала настройте службу ИИ.
tr: Önce yapay zekâ servisini yapılandırın.
zh_hant: 請先設定 AI 服務

# panelError.missingPrompt
source: 未找到对应处理模板
ar: لم يتم العثور على التوجيه المطابق.
de: Der passende Prompt wurde nicht gefunden.
en: The matching prompt was not found.
es: No se encontró el prompt correspondiente.
fr: Le prompt correspondant est introuvable.
ja: 一致するプロンプトが見つかりませんでした。
ko: 일치하는 프롬프트를 찾을 수 없습니다.
pt: O prompt correspondente não foi encontrado.
ru: Соответствующий промпт не найден.
tr: Eşleşen istem bulunamadı.
zh_hant: 未找到對應的處理模板

# panelError.permissionRequired
source: 需要辅助功能授权
ar: يلزم منح إذن تسهيلات الاستخدام.
de: Bedienungshilfen-Berechtigung erforderlich.
en: Accessibility permission is required.
es: Se requiere permiso de accesibilidad.
fr: L’autorisation d’accessibilité est requise.
ja: アクセシビリティの許可が必要です。
ko: 손쉬운 사용 권한이 필요합니다.
pt: A permissão de acessibilidade é necessária.
ru: Требуется разрешение на универсальный доступ.
tr: Erişilebilirlik izni gerekli.
zh_hant: 需要輔助使用權限

# panelError.missingProvider
source: 请先配置 AI 服务
ar: قم بتكوين خدمة الذكاء الاصطناعي أولاً.
de: Konfigurieren Sie zuerst den KI-Dienst.
en: Configure the AI service first.
es: Primero configure el servicio de IA.
fr: Configurez d’abord le service IA.
ja: 先に AI サービスを設定してください。
ko: 먼저 AI 서비스를 구성하세요.
pt: Configure primeiro o serviço de IA.
ru: Сначала настройте службу ИИ.
tr: Önce yapay zekâ servisini yapılandırın.
zh_hant: 請先設定 AI 服務

# panelError.missingAPIKey
source: 请配置 API Key
ar: قم بتكوين مفتاح API أولاً.
de: Konfigurieren Sie zuerst den API-Schlüssel.
en: Configure the API key first.
es: Primero configure la clave API.
fr: Configurez d'abord la clé API.
ja: 最初に API キーを設定してください。
ko: 먼저 API 키를 구성하세요.
pt: Configure primeiro a chave de API.
ru: Сначала настройте ключ API.
tr: Önce API anahtarını yapılandırın.
zh_hant: 請設定 API Key

# capture.error.missingSelection
source: 未找到选中文本
ar: لم يتم العثور على نص محدد.
de: Kein markierter Text gefunden.
en: No selected text found.
es: No se encontró ningún texto seleccionado.
fr: Aucun texte sélectionné trouvé.
ja: 選択されたテキストが見つかりません。
ko: 선택한 텍스트가 없습니다.
pt: Nenhum texto selecionado encontrado.
ru: Выделенный текст не найден.
tr: Seçili metin bulunamadı.
zh_hant: 未找到選取的文字

# capture.error.permissionRequired
source: 需要辅助功能授权
ar: يلزم منح إذن تسهيلات الاستخدام.
de: Bedienungshilfen-Berechtigung erforderlich.
en: Accessibility permission is required.
es: Se requiere permiso de accesibilidad.
fr: L’autorisation d’accessibilité est requise.
ja: アクセシビリティの許可が必要です。
ko: 손쉬운 사용 권한이 필요합니다.
pt: A permissão de acessibilidade é necessária.
ru: Требуется разрешение на универсальный доступ.
tr: Erişilebilirlik izni gerekli.
zh_hant: 需要輔助使用權限

# capture.error.missingApplication
source: 未找到当前应用
ar: لم يتم العثور على التطبيق الحالي.
de: Aktuelle App nicht gefunden.
en: Current app not found.
es: No se encontró la aplicación actual.
fr: Application actuelle introuvable.
ja: 現在のアプリが見つかりません。
ko: 현재 앱을 찾을 수 없습니다.
pt: Aplicativo atual não encontrado.
ru: Текущее приложение не найдено.
tr: Geçerli uygulama bulunamadı.
zh_hant: 未找到目前應用程式

# capture.error.unsupportedBrowserAutomation
source: 当前浏览器不支持自动化取词
ar: لا يدعم المتصفح الحالي قراءة النص المحدد عبر الأتمتة.
de: Der aktuelle Browser unterstützt kein automatisiertes Erfassen des ausgewählten Textes.
en: The current browser does not support reading selected text using Automation.
es: El navegador actual no permite obtener el texto seleccionado mediante automatización.
fr: Le navigateur actuel ne permet pas la lecture automatisée du texte sélectionné.
ja: 現在のブラウザはオートメーションによる選択テキストの取得に対応していません。
ko: 현재 브라우저는 자동화를 통한 선택한 텍스트 읽기를 지원하지 않습니다.
pt: O navegador atual não oferece suporte à leitura do texto selecionado por Automação.
ru: Текущий браузер не поддерживает автоматическое чтение выделенного текста.
tr: Geçerli tarayıcı, seçimin otomatik okunmasını desteklemiyor.
zh_hant: 目前瀏覽器不支援自動化取詞

# capture.error.invalidAutomationScript
source: 自动化脚本无效
ar: البرنامج النصي للأتمتة غير صالح.
de: Automatisierungsskript ist ungültig.
en: Automation script is invalid.
es: El script de automatización no es válido.
fr: Le script d'automatisation n'est pas valide.
ja: オートメーションスクリプトが無効です。
ko: 자동화 스크립트가 잘못되었습니다.
pt: O script de automação é inválido.
ru: Недопустимый сценарий автоматизации.
tr: Otomasyon betiği geçersiz.
zh_hant: 自動化腳本無效

# capture.error.automationTimeout
source: 自动化取词超时
ar: انتهت مهلة قراءة النص المحدد عبر الأتمتة.
de: Zeitüberschreitung beim automatisierten Erfassen des ausgewählten Textes.
en: Reading selected text using Automation timed out.
es: Se agotó el tiempo de espera al obtener el texto seleccionado mediante automatización.
fr: Le délai de lecture automatisée du texte sélectionné a été dépassé.
ja: オートメーションによる選択テキストの取得がタイムアウトしました。
ko: 자동화를 통한 선택한 텍스트 읽기 시간이 초과되었습니다.
pt: Tempo esgotado ao capturar a seleção por automação.
ru: Истекло время ожидания чтения выделенного текста через автоматизацию.
tr: Otomasyon seçimi zaman aşımına uğradı.
zh_hant: 自動化取詞逾時

# capture.error.automationFailed
source: 自动化取词失败
ar: فشلت قراءة النص المحدد عبر الأتمتة.
de: Automatisiertes Erfassen des ausgewählten Textes fehlgeschlagen.
en: Unable to read selected text using Automation.
es: No se pudo obtener el texto seleccionado mediante automatización.
fr: La lecture automatisée du texte sélectionné a échoué.
ja: オートメーションによる選択テキストの取得に失敗しました。
ko: 자동화를 통한 선택한 텍스트 읽기에 실패했습니다.
pt: Falha ao capturar a seleção por automação.
ru: Не удалось прочитать выделенный текст через автоматизацию.
tr: Otomasyon seçimi başarısız oldu.
zh_hant: 自動化取詞失敗

# capture.error.axTimeout
source: 辅助功能取词超时
ar: انتهت مهلة التقاط النص عبر تسهيلات الاستخدام
de: Zeitüberschreitung beim Erfassen des Textes über Bedienungshilfen
en: Reading selected text using Accessibility timed out.
es: Se agotó el tiempo de espera al obtener el texto mediante Accesibilidad
fr: Le délai de capture via l’accessibilité a été dépassé
ja: アクセシビリティによる選択テキストの取得がタイムアウトしました
ko: 손쉬운 사용을 통한 텍스트 읽기 시간이 초과되었습니다.
pt: Tempo esgotado ao capturar o texto via Acessibilidade
ru: Истекло время ожидания захвата через универсальный доступ
tr: Erişilebilirlik yakalaması zaman aşımına uğradı
zh_hant: 輔助功能取詞逾時

# secretStore.error.unexpectedItemData
source: API Key 数据无效。
ar: بيانات مفتاح API غير صالحة.
de: API-Schlüsseldaten sind ungültig.
en: API key data is invalid.
es: Los datos de la clave API no son válidos.
fr: Les données de la clé API ne sont pas valides.
ja: API キーのデータが無効です。
ko: API 키 데이터가 잘못되었습니다.
pt: Os dados da chave de API são inválidos.
ru: Данные ключа API недействительны.
tr: API anahtarı verileri geçersiz.
zh_hant: API Key 資料無效。

# secretStore.error.security
source: 无法访问钥匙串。
ar: يتعذر الوصول إلى سلسلة المفاتيح.
de: Zugriff auf den Schlüsselbund nicht möglich.
en: Unable to access the keychain.
es: No se puede acceder al llavero.
fr: Impossible d'accéder au trousseau.
ja: キーチェーンにアクセスできません。
ko: 키체인에 접근할 수 없습니다.
pt: Não é possível acessar as Chaves.
ru: Невозможно получить доступ к связке ключей.
tr: Keychain'e erişilemiyor.
zh_hant: 無法存取鑰匙圈。

# settings.prompt.template.required
source: 必须包含 {{text}}
ar: يجب أن يتضمن {{text}}
de: Muss {{text}} enthalten
en: Must include {{text}}
es: Debe incluir {{text}}
fr: Doit inclure {{text}}
ja: {{text}} を含めてください
ko: {{text}} 포함 필수
pt: Deve incluir {{text}}
ru: Должен содержать {{text}}
tr: {{text}} içermelidir
zh_hant: 必須包含 {{text}}

# settings.promptRow.systemPreview
source: 系统：%@
ar: النظام: %@
de: System: %@
en: System: %@
es: Sistema: %@
fr: Système : %@
ja: システム：%@
ko: 시스템: %@
pt: Sistema: %@
ru: Системный промпт: %@
tr: Sistem: %@
zh_hant: 系統：%@

# settings.promptRow.templatePreview
source: 模板：%@
ar: القالب: %@
de: Vorlage: %@
en: Template: %@
es: Plantilla: %@
fr: Modèle : %@
ja: テンプレート：%@
ko: 템플릿: %@
pt: Modelo: %@
ru: Шаблон: %@
tr: Şablon: %@
zh_hant: 範本：%@
